In [1]:
#Terlebih dahulu mengimport modules

import pandas as pd

print(pd.__version__)

1.2.4

In [2]:
#Mempersiapkan data frame

data = {'Nama':['Dodi', 'Gaga', 'Maya', 'Gangga'],
        'Jenis_Kelamin':['L', 'L', 'P', 'L'],
        'Usia':[35, 24, 22, 27]}

df = pd.DataFrame(data)
df

     Nama Jenis_Kelamin  Usia
0    Dodi             L    35
1    Gaga             L    24
2    Maya             P    22
3  Gangga             L    27

In [3]:
#Mengeluarkan kolom dari Data Frame

usia = df.pop('Usia').to_frame() #Kolom yang mau dikeluarkan dgn memanggil method pop

In [4]:
df #Memanggil data frame

     Nama Jenis_Kelamin
0    Dodi             L
1    Gaga             L
2    Maya             P
3  Gangga             L

In [6]:
usia #Memanggil kolom usia

   Usia
0    35
1    24
2    22
3    27